vanvught/GD32F303RC-DMX512-RDM/lib-dmx/src/gd32/dmx.cpp
/**
 * @file dmx.cpp
 */
/* Copyright (C) 2021-2026 by Arjan van Vught mailto:info@gd32-dmx.org
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:

 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.

 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#if defined(CONFIG_TIMER6_HAVE_NO_IRQ_HANDLER)
#error
#endif

#if !defined(CONFIG_DMX_NO_OPTIMIZE)
#pragma GCC push_options
#pragma GCC optimize("O3")
#endif

#include <cstdint>
#include <cstddef>
#include <cstring>
#include <utility>
#include <cassert>

#include "gd32/dmx.h" // IWYU pragma: keep
#include "dmx/dmx_config.h"
#include "gd32/dmx_assert.h"
#include "gd32/dmx_port.h"
#include "dmxconst.h"
#include "e120.h"
#include "rdmconst.h"
#include "rdm_e120.h"
#include "timing.h"
#include "gd32.h"
#include "gd32_dma.h"
#include "gd32_uart.h"
#include "gd32_gpio.h"
#include "dmx_internal.h"
#if defined(LOGIC_ANALYZER)
#include "logic_analyzer.h" // IWYU pragma: keep
#endif
#include "dmx_debug.h"
#include "common/utils/utils_math.h"

static_assert(dmx::buffer::kSize % 4 == 0); // multiple of uint32_t

namespace dmx {
static constexpr uint32_t kDmxSlotsCompleteFlag = 0x8000;
static constexpr uint32_t kRdmSlotsCompleteFlag = 0x4000;

enum class TxRxState { kIdle, kDmxBreak, kDmxMab, kDmxData, kDmxInter, kRdmData, kRdmChecksumh, kRdmChecksuml, kRdmdisc };
enum class RdmTxState { kIdle, kBreak, kMab, kData, kDirection };
enum class PortState { kIdle, kTx, kRx };

struct DmxTxDataPacket {
    uint8_t data[dmx::buffer::kSize];
    uint32_t length;
};

struct DmxTxPacket {
    DmxTxDataPacket data[2];
    uint32_t write_index;
    uint32_t read_index;
    bool data_pending;
};

struct DmxTxData {
    DmxTxPacket dmx;
    OutputStyle output_style ALIGNED;
    volatile TxRxState state;
};

struct RdmTxDataPacket {
    uint8_t data[sizeof(struct TRdmMessage)];
    uint32_t length;
};

struct RdmTxPacket {
    struct RdmTxDataPacket data;
};

struct RdmTxData {
    RdmTxPacket rdm;
    volatile RdmTxState state;
};

struct DmxTransmit {
    uint32_t break_time;
    uint32_t mab_time;
    uint32_t inter_time;
};

struct RxDmxPackets {
    uint32_t per_second;
    uint32_t count;
    uint32_t count_previous;
};

struct RxDmxData {
    uint8_t data[dmx::buffer::kSize] ALIGNED; // multiple of uint32_t
    uint32_t slots_in_packet;
};

#if defined(CONFIG_DMX_DOUBLE_INPUT_BUFFER)
enum class ActiveBuffer { kA, kB };
#endif

struct RxData {
    struct Dmx {
#if defined(CONFIG_DMX_DOUBLE_INPUT_BUFFER)
        volatile RxDmxData buffer_a;
        volatile RxDmxData buffer_b;
        ActiveBuffer active{ActiveBuffer::kA}; // Active write buffer
#else
        volatile RxDmxData current;
#endif
        RxDmxData previous;
    } dmx ALIGNED;
    struct Rdm {
        volatile uint8_t data[sizeof(struct TRdmMessage)] ALIGNED;
        volatile uint32_t index;
    } rdm ALIGNED;
    volatile TxRxState state;
} ALIGNED;
} // namespace dmx

static constexpr dmx::port::Info kDirGpio[dmx::config::max::kPorts] = {
    {dmx::config::kPort0},
#if DMX_MAX_PORTS >= 2
    {dmx::config::kPort1},
#endif
#if DMX_MAX_PORTS >= 3
    {dmx::config::kPort2},
#endif
#if DMX_MAX_PORTS >= 4
    {dmx::config::kPort3},
#endif
#if DMX_MAX_PORTS >= 5
    {dmx::config::kPort4},
#endif
#if DMX_MAX_PORTS >= 6
    {dmx::config::kPort5},
#endif
#if DMX_MAX_PORTS >= 7
    {dmx::config::kPort6},
#endif
#if DMX_MAX_PORTS == 8
    {dmx::config::kPort7},
#endif
};

consteval bool AreUartsUnique() {
    for (uint32_t i = 0; i < dmx::config::max::kPorts; ++i) {
        for (uint32_t j = i + 1; j < dmx::config::max::kPorts; ++j) {
            if (kDirGpio[i].uart == kDirGpio[j].uart) {
                return false;
            }
        }
    }

    return true;
}

static_assert(AreUartsUnique(), "DMX port UARTs must be unique");

consteval uint32_t GetPortByUart(uint32_t uart) {
    for (uint32_t port = 0; port < dmx::config::max::kPorts; ++port) {
        if (std::to_underlying(kDirGpio[port].uart) == uart) {
            return port;
        }
    }

    return dmx::config::max::kPorts;
}

static volatile dmx::PortState sv_port_state[dmx::config::max::kPorts] ALIGNED;

#if !defined(CONFIG_DMX_DISABLE_STATISTICS)
static volatile dmx::TotalStatistics sv_total_statistics[dmx::config::max::kPorts] ALIGNED;
#endif

// DMX RX
static volatile dmx::RxDmxPackets sv_rx_dmx_packets[dmx::config::max::kPorts] ALIGNED;
// RDM RX
volatile uint32_t gsv_rdm_data_receive_end[dmx::config::max::kPorts];
// DMX RDM RX
static volatile dmx::RxData sv_rx_buffer[dmx::config::max::kPorts] ALIGNED;
// DMX TX
static dmx::DmxTxData s_DmxTxBuffer[dmx::config::max::kPorts] ALIGNED SECTION_DMA_BUFFER;
static dmx::DmxTransmit s_dmx_transmit;
// RDM TX
static dmx::RdmTxData s_RdmTxBuffer[dmx::config::max::kPorts] ALIGNED SECTION_DMA_BUFFER;

#if defined(CONFIG_DMX_DOUBLE_INPUT_BUFFER)
// The active DMX data buffer for writes
volatile dmx::RxDmxData& GetWriteDmxDataBuffer(uint32_t port_index) {
    if (sv_rx_buffer[port_index].dmx.active == dmx::ActiveBuffer::kA) {
        return sv_rx_buffer[port_index].dmx.buffer_a;
    }
    return sv_rx_buffer[port_index].dmx.buffer_b;
}

