vanvught/GD32F303RC-DMX512-RDM/lib-dmx/src/gd32/dmx.cpp
// The non-active DMX data buffer for reads
volatile dmx::RxDmxData& GetReadDmxDataBuffer(uint32_t port_index) {
    if (sv_rx_buffer[port_index].dmx.active == dmx::ActiveBuffer::kA) {
        return sv_rx_buffer[port_index].dmx.buffer_b;
    }
    return sv_rx_buffer[port_index].dmx.buffer_a;
}

// Swap the active buffer for writing
void SwapActiveDmxDataBuffer(uint32_t port_index) {
    if (sv_rx_buffer[port_index].dmx.active == dmx::ActiveBuffer::kA) {
        sv_rx_buffer[port_index].dmx.active = dmx::ActiveBuffer::kB;
    } else {
        sv_rx_buffer[port_index].dmx.active = dmx::ActiveBuffer::kA;
    }
}
#endif

template <uint32_t kUsartPeripheral> void IrqHandlerDmxRdmInput() {
    constexpr auto kPortIndex = GetPortByUart(kUsartPeripheral);
    auto& rx_buffer = sv_rx_buffer[kPortIndex];
#if defined(CONFIG_DMX_DOUBLE_INPUT_BUFFER)
    auto& dmx_data_buffer = GetWriteDmxDataBuffer(kPortIndex);
#else
#endif
    const auto kIsFlagIdleFrame = (USART_REG_VAL(kUsartPeripheral, USART_FLAG_IDLE) & BIT(USART_BIT_POS(USART_FLAG_IDLE))) == BIT(USART_BIT_POS(USART_FLAG_IDLE));

    // Software can clear this bit by reading the USART_STAT and USART_DATA registers one by one.
    if (kIsFlagIdleFrame) {
        static_cast<void>(GET_BITS(USART_RDATA(kUsartPeripheral), 0U, 8U));

#if defined(CONFIG_DMX_DOUBLE_INPUT_BUFFER)
        switch (rx_buffer.state) {
            case dmx::TxRxState::kDmxBreak:
                break;
            case dmx::TxRxState::kDmxData: {
                dmx_data_buffer.slots_in_packet |= dmx::kDmxSlotsCompleteFlag;
                break;
            }
            case dmx::TxRxState::kRdmdisc: {
                rx_buffer.state = dmx::TxRxState::kIdle;
                rx_buffer.rdm.index |= dmx::kRdmSlotsCompleteFlag;
                break;
            }
            default: {
                rx_buffer.state = dmx::TxRxState::kIdle;
                break;
            }
        }

        return;
#else
        if (rx_buffer.state == dmx::TxRxState::kDmxData) {
            rx_buffer.state = dmx::TxRxState::kIdle;
            rx_buffer.dmx.current.slots_in_packet |= dmx::kDmxSlotsCompleteFlag;

            return;
        }

        if (rx_buffer.state == dmx::TxRxState::kRdmdisc) {
            rx_buffer.state = dmx::TxRxState::kIdle;
            rx_buffer.rdm.index |= dmx::kRdmSlotsCompleteFlag;

            return;
        }

        return;
#endif
    }

    const auto kIsFlagFrameError = (USART_REG_VAL(kUsartPeripheral, USART_FLAG_FERR) & BIT(USART_BIT_POS(USART_FLAG_FERR))) == BIT(USART_BIT_POS(USART_FLAG_FERR));
    /*
     * Software can clear this bit by reading the USART_STAT and USART_DATA registers one by one.
     */
    if (kIsFlagFrameError) {
        static_cast<void>(GET_BITS(USART_RDATA(kUsartPeripheral), 0U, 8U));

#if defined(CONFIG_DMX_DOUBLE_INPUT_BUFFER)
        switch (rx_buffer.state) {
            case dmx::TxRxState::kRdmdisc:
            case dmx::TxRxState::kIdle: {
                break;
            }
            case dmx::TxRxState::kDmxData: {
                if (!(dmx_data_buffer.slots_in_packet & dmx::kDmxSlotsCompleteFlag)) {
                    return;
                }
                break;
            }
            case dmx::TxRxState::kRdmData: {
                if (!(rx_buffer.rdm.index & dmx::kRdmSlotsCompleteFlag)) {
                    return;
                }
                break;
            }
            default: {
                rx_buffer.state = dmx::TxRxState::kIdle;
                return;
            }
        }

        rx_buffer.state = dmx::TxRxState::kDmxBreak;
        SwapActiveDmxDataBuffer(kPortIndex);
#else
        if (rx_buffer.state == dmx::TxRxState::kIdle) {
            rx_buffer.state = dmx::TxRxState::kDmxBreak;
        }

        return;
#endif
    }

    const auto kData = static_cast<uint8_t>(GET_BITS(USART_RDATA(kUsartPeripheral), 0U, 8U));

    switch (rx_buffer.state) {
        case dmx::TxRxState::kIdle:
            rx_buffer.state = dmx::TxRxState::kRdmdisc;
            rx_buffer.rdm.data[0] = kData;
            rx_buffer.rdm.index = 1;
            break;

        case dmx::TxRxState::kDmxBreak:
            switch (kData) {
                case dmx::kStartCode:
#if defined(CONFIG_DMX_DOUBLE_INPUT_BUFFER)
                    dmx_data_buffer.data[0] = dmx::kStartCode;
                    dmx_data_buffer.slots_in_packet = 1;
#else
                    rx_buffer.dmx.current.data[0] = dmx::kStartCode;
                    rx_buffer.dmx.current.slots_in_packet = 1;
#endif
                    sv_rx_dmx_packets[kPortIndex].count = sv_rx_dmx_packets[kPortIndex].count + 1;
                    rx_buffer.state = dmx::TxRxState::kDmxData;
                    break;
                case E120_SC_RDM:
                    rx_buffer.rdm.data[0] = E120_SC_RDM;
                    rx_buffer.rdm.index = 1;
                    rx_buffer.state = dmx::TxRxState::kRdmData;
                    break;
                default:
#if defined(CONFIG_DMX_DOUBLE_INPUT_BUFFER)
                    dmx_data_buffer.slots_in_packet = 0;
#else
                    rx_buffer.dmx.current.slots_in_packet = 0;
#endif
                    rx_buffer.rdm.index = 0;
                    rx_buffer.state = dmx::TxRxState::kIdle;
                    break;
            }
            break;
        case dmx::TxRxState::kDmxData: {
#if defined(CONFIG_DMX_DOUBLE_INPUT_BUFFER)
            dmx_data_buffer.slots_in_packet &= ~dmx::kDmxSlotsCompleteFlag;
            auto index = dmx_data_buffer.slots_in_packet;
            dmx_data_buffer.data[index] = kData;
            index++;
            dmx_data_buffer.slots_in_packet = index;

            if (dmx_data_buffer.slots_in_packet > dmx::kChannelsMax) {
                dmx_data_buffer.slots_in_packet |= dmx::kDmxSlotsCompleteFlag;

                rx_buffer.state = dmx::TxRxState::kIdle;
                break;
            }
#else
            auto index = rx_buffer.dmx.current.slots_in_packet;
            rx_buffer.dmx.current.data[index] = kData;
            index++;
            rx_buffer.dmx.current.slots_in_packet = index;

