vanvught/GD32F303RC-DMX512-RDM/lib-dmx/src/gd32/dmx.cpp
                case dmx::RdmTxState::kMab:
                    [[likely]] {
                        DMA_START_RDM_TX(kPortIndex, UART4, UART4_DMAx, UART4_TX_DMA_CHx);
                    }
                    break;

                case dmx::RdmTxState::kDirection:
                    [[likely]] {
                        s_RdmTxBuffer[kPortIndex].state = dmx::RdmTxState::kIdle;
                        sv_port_state[kPortIndex] = dmx::PortState::kIdle;
                        Dmx::Get()->SetPortDirection<kPortIndex, dmx::Direction::kInput, true>();

#if !defined(CONFIG_DMX_DISABLE_STATISTICS)
                        const auto kSent = sv_total_statistics[kPortIndex].rdm.sent.classes + 1;
                        sv_total_statistics[kPortIndex].rdm.sent.classes = kSent;
#endif // !defined(CONFIG_DMX_DISABLE_STATISTICS)
                    }
                    break;

                default:
                    [[unlikely]] assert(false && "switch");
                    break;
            }
        }

        TIMER_INTF(TIMER4) = (~TIMER_INT_FLAG_CH0);
    }
#endif // defined(DMX_USE_UART4)
// USART 5
#if defined(DMX_USE_USART5)
    if ((TIMER_INTF(TIMER4) & TIMER_INT_FLAG_CH1) == TIMER_INT_FLAG_CH1) {
        constexpr auto kPortIndex = GetPortByUart(USART5);
        if (s_DmxTxBuffer[kPortIndex].state != dmx::TxRxState::kIdle) [[likely]] {
            switch (s_DmxTxBuffer[kPortIndex].state) {
                case dmx::TxRxState::kDmxInter:
                    [[likely]] {
                        Gd32GpioModeOutput<USART5_GPIOx, USART5_TX_GPIO_PINx>();
                        GPIO_BC(USART5_GPIOx) = USART5_TX_GPIO_PINx;
                        s_DmxTxBuffer[kPortIndex].state = dmx::TxRxState::kDmxBreak;
                        TIMER_CH1CV(TIMER4) = TIMER_CNT(TIMER4) + s_dmx_transmit.break_time;
                    }
                    break;

                case dmx::TxRxState::kDmxBreak:
                    [[likely]] {
                        Gd32GpioModeAf<USART5_GPIOx, USART5_TX_GPIO_PINx, USART5>();
                        s_DmxTxBuffer[kPortIndex].state = dmx::TxRxState::kDmxMab;
                        TIMER_CH1CV(TIMER4) = TIMER_CNT(TIMER4) + s_dmx_transmit.mab_time;
                    }
                    break;

                case dmx::TxRxState::kDmxMab:
                    [[likely]] {
                        DMA_RESTART_DMX_TX(kPortIndex, USART5, USART5_DMAx, USART5_TX_DMA_CHx);
                    }
                    break;

                default:
                    [[unlikely]] assert(false && "switch");
                    break;
            }
        } else if (s_RdmTxBuffer[kPortIndex].state != dmx::RdmTxState::kIdle) {
            switch (s_RdmTxBuffer[kPortIndex].state) {
                case dmx::RdmTxState::kBreak:
                    [[likely]] {
                        Gd32GpioModeAf<USART5_GPIOx, USART5_TX_GPIO_PINx, USART5>();
                        s_RdmTxBuffer[kPortIndex].state = dmx::RdmTxState::kMab;
                        TIMER_CH1CV(TIMER4) = TIMER_CNT(TIMER4) + rdm::transmit::kMabTimeTypical;
                    }
                    break;

                case dmx::RdmTxState::kMab:
                    [[likely]] {
                        DMA_START_RDM_TX(kPortIndex, USART5, USART5_DMAx, USART5_TX_DMA_CHx);
                    }
                    break;

                case dmx::RdmTxState::kDirection:
                    [[likely]] {
                        s_RdmTxBuffer[kPortIndex].state = dmx::RdmTxState::kIdle;
                        sv_port_state[kPortIndex] = dmx::PortState::kIdle;
                        Dmx::Get()->SetPortDirection<kPortIndex, dmx::Direction::kInput, true>();
#if !defined(CONFIG_DMX_DISABLE_STATISTICS)
                        const auto kSent = sv_total_statistics[kPortIndex].rdm.sent.classes + 1;
                        sv_total_statistics[kPortIndex].rdm.sent.classes = kSent;
#endif // !defined(CONFIG_DMX_DISABLE_STATISTICS)
                    }
                    break;

                default:
                    [[unlikely]] assert(false && "switch");
                    break;
            }
        }

        TIMER_INTF(TIMER4) = (~TIMER_INT_FLAG_CH1);
    }
#endif // defined(DMX_USE_USART5)
// UART 6
#if defined(DMX_USE_UART6)
    if ((TIMER_INTF(TIMER4) & TIMER_INT_FLAG_CH2) == TIMER_INT_FLAG_CH2) {
        constexpr auto kPortIndex = GetPortByUart(UART6);
        if (s_DmxTxBuffer[kPortIndex].state != dmx::TxRxState::kIdle) [[likely]] {
            switch (s_DmxTxBuffer[kPortIndex].state) {
                case dmx::TxRxState::kDmxInter:
                    Gd32GpioModeOutput<UART6_GPIOx, UART6_TX_GPIO_PINx>();
                    GPIO_BC(UART6_GPIOx) = UART6_TX_GPIO_PINx;
                    s_DmxTxBuffer[kPortIndex].state = dmx::TxRxState::kDmxBreak;
                    TIMER_CH2CV(TIMER4) = TIMER_CNT(TIMER4) + s_dmx_transmit.break_time;
                    break;
                case dmx::TxRxState::kDmxBreak:
                    Gd32GpioModeAf<UART6_GPIOx, UART6_TX_GPIO_PINx, UART6>();
                    s_DmxTxBuffer[kPortIndex].state = dmx::TxRxState::kDmxMab;
                    TIMER_CH2CV(TIMER4) = TIMER_CNT(TIMER4) + s_dmx_transmit.mab_time;
                    break;
                case dmx::TxRxState::kDmxMab: {
                    DMA_RESTART_DMX_TX(kPortIndex, UART6, UART6_DMAx, UART6_TX_DMA_CHx);
                } break;
                default:
                    break;
            }
        } else if (s_RdmTxBuffer[kPortIndex].state != dmx::RdmTxState::kIdle) {
            switch (s_RdmTxBuffer[kPortIndex].state) {
                case dmx::RdmTxState::kBreak:
                    [[likely]] {
                        Gd32GpioModeAf<UART4_TX_GPIOx, UART4_TX_GPIO_PINx, UART4>();
                        s_RdmTxBuffer[kPortIndex].state = dmx::RdmTxState::kMab;
                        TIMER_CH2CV(TIMER4) = TIMER_CNT(TIMER4) + rdm::transmit::kMabTimeTypical;
                    }
                    break;

