vanvught/GD32F303RC-DMX512-RDM/lib-dmx/src/gd32/dmx.cpp
                case dmx::RdmTxState::kMab:
                    [[likely]] {
                        DMA_START_RDM_TX(kPortIndex, UART6, UART6_DMAx, UART6_TX_DMA_CHx);
                    }
                    break;

                case dmx::RdmTxState::kDirection:
                    [[likely]] {
                        s_RdmTxBuffer[kPortIndex].state = dmx::RdmTxState::kIdle;
                        sv_port_state[kPortIndex] = dmx::PortState::kIdle;
                        Dmx::Get()->SetPortDirection<kPortIndex, dmx::Direction::kInput, true>();
#if !defined(CONFIG_DMX_DISABLE_STATISTICS)
                        const auto kSent = sv_total_statistics[kPortIndex].rdm.sent.classes + 1;
                        sv_total_statistics[kPortIndex].rdm.sent.classes = kSent;
#endif // !defined(CONFIG_DMX_DISABLE_STATISTICS)
                    }
                    break;

                default:
                    [[unlikely]] assert(false && "switch");
                    break;
            }
        }

        TIMER_INTF(TIMER4) = (~TIMER_INT_FLAG_CH2);
    }
#endif // defined(DMX_USE_UART6)
// UART 7
#if defined(DMX_USE_UART7)
    if ((TIMER_INTF(TIMER4) & TIMER_INT_FLAG_CH3) == TIMER_INT_FLAG_CH3) {
        constexpr auto kPortIndex = GetPortByUart(UART7);
        if (s_DmxTxBuffer[kPortIndex].state != dmx::TxRxState::kIdle) [[likely]] {
            switch (s_DmxTxBuffer[kPortIndex].state) {
                case dmx::TxRxState::kDmxInter:
                    Gd32GpioModeOutput<UART7_GPIOx, UART7_TX_GPIO_PINx>();
                    GPIO_BC(UART7_GPIOx) = UART7_TX_GPIO_PINx;
                    s_DmxTxBuffer[kPortIndex].state = dmx::TxRxState::kDmxBreak;
                    TIMER_CH3CV(TIMER4) = TIMER_CNT(TIMER4) + s_dmx_transmit.break_time;
                    break;
                case dmx::TxRxState::kDmxBreak:
                    Gd32GpioModeAf<UART7_GPIOx, UART7_TX_GPIO_PINx, UART7>();
                    s_DmxTxBuffer[kPortIndex].state = dmx::TxRxState::kDmxMab;
                    TIMER_CH3CV(TIMER4) = TIMER_CNT(TIMER4) + s_dmx_transmit.mab_time;
                    break;
                case dmx::TxRxState::kDmxMab: {
                    DMA_RESTART_DMX_TX(kPortIndex, UART7, UART7_DMAx, UART7_TX_DMA_CHx);
                } break;
                default:
                    break;
            }
        } else if (s_RdmTxBuffer[kPortIndex].state != dmx::RdmTxState::kIdle) {
            switch (s_RdmTxBuffer[kPortIndex].state) {
                case dmx::RdmTxState::kBreak:
                    [[likely]] {
                        Gd32GpioModeAf<UART7_GPIOx, UART7_TX_GPIO_PINx, UART7>();
                        s_RdmTxBuffer[kPortIndex].state = dmx::RdmTxState::kMab;
                        TIMER_CH3CV(TIMER4) = TIMER_CNT(TIMER4) + rdm::transmit::kMabTimeTypical;
                    }
                    break;

                case dmx::RdmTxState::kMab:
                    [[likely]] {
                        DMA_START_RDM_TX(kPortIndex, UART7, UART7_DMAx, UART7_TX_DMA_CHx);
                    }
                    break;

                case dmx::RdmTxState::kDirection:
                    [[likely]] {
                        s_RdmTxBuffer[kPortIndex].state = dmx::RdmTxState::kIdle;
                        sv_port_state[kPortIndex] = dmx::PortState::kIdle;
                        Dmx::Get()->SetPortDirection<kPortIndex, dmx::Direction::kInput, true>();
#if !defined(CONFIG_DMX_DISABLE_STATISTICS)
                        const auto kSent = sv_total_statistics[kPortIndex].rdm.sent.classes + 1;
                        sv_total_statistics[kPortIndex].rdm.sent.classes = kSent;
#endif // !defined(CONFIG_DMX_DISABLE_STATISTICS)
                    }
                    break;

                default:
                    [[unlikely]] assert(false && "switch");
                    break;
            }
        }

        TIMER_INTF(TIMER4) = (~TIMER_INT_FLAG_CH3);
    }
#endif // defined(DMX_USE_UART7)
    // Clear all remaining interrupt flags (safety measure)
    TIMER_INTF(TIMER4) = UINT32_MAX;
}

void TIMER6_IRQHandler() {
    const auto kIntFlag = TIMER_INTF(TIMER6);

    if ((kIntFlag & TIMER_INT_FLAG_UP) == TIMER_INT_FLAG_UP) {
#if !defined(CONFIG_DMX_TRANSMIT_ONLY)
        for (uint32_t i = 0; i < DMX_MAX_PORTS; i++) {
            auto& packet = sv_rx_dmx_packets[i];
            packet.per_second = packet.count - packet.count_previous;
            packet.count_previous = packet.count;
        }
#endif
        gv_seconds.uptime = gv_seconds.uptime + 1;
    }

    // Clear all remaining interrupt flags (safety measure)
    TIMER_INTF(TIMER6) = (~kIntFlag);
}

// USART 0
#if defined(DMX_USE_USART0)
#if defined(GD32F4XX) || defined(GD32H7XX)
void DMA1_Channel7_IRQHandler() {
    if (Gd32DmaInterruptFlagGet<DMA1, DMA_CH7, DMA_INTERRUPT_FLAG_GET>()) {
        Gd32DmaInterruptDisable<DMA1, DMA_CH7, DMA_INTERRUPT_DISABLE>();

        constexpr auto kPortIndex = GetPortByUart(USART0);

        if (s_DmxTxBuffer[kPortIndex].state != dmx::TxRxState::kIdle) [[likely]] {
            if (s_DmxTxBuffer[kPortIndex].output_style == dmx::OutputStyle::kDelta) {
                s_DmxTxBuffer[kPortIndex].state = dmx::TxRxState::kIdle;
            } else {
                TIMER_CH0CV(TIMER1) = TIMER_CNT(TIMER1) + s_dmx_transmit.inter_time;
                s_DmxTxBuffer[kPortIndex].state = dmx::TxRxState::kDmxInter;
            }
#if !defined(CONFIG_DMX_DISABLE_STATISTICS)
            const auto kSent = sv_total_statistics[kPortIndex].dmx.sent + 1;
            sv_total_statistics[kPortIndex].dmx.sent = kSent;
#endif // !defined(CONFIG_DMX_DISABLE_STATISTICS)
        } else if (s_RdmTxBuffer[kPortIndex].state != dmx::RdmTxState::kIdle) {
            TIMER_CH0CV(TIMER1) = TIMER_CNT(TIMER1) + rdm::transmit::kDirectionTime;
            s_RdmTxBuffer[kPortIndex].state = dmx::RdmTxState::kDirection;
        }
    }

    Gd32DmaInterruptFlagClear<DMA1, DMA_CH7, DMA_INTERRUPT_FLAG_CLEAR>();
}
#else // defined(GD32F4XX) || defined(GD32H7XX)
void DMA0_Channel3_IRQHandler() {
    if (Gd32DmaInterruptFlagGet<DMA0, DMA_CH3, DMA_INTERRUPT_FLAG_GET>()) {
        Gd32DmaInterruptDisable<DMA0, DMA_CH3, DMA_INTERRUPT_DISABLE>();

