vanvught/GD32F303RC-DMX512-RDM/lib-dmx/src/gd32/dmx.cpp
    if constexpr (kDirGpio[kPortIndex].usage == dmx::port::Usage::kTxRx) {
        if (port_direction_[kPortIndex] != kPortDirection) {
            port_direction_[kPortIndex] = kPortDirection;

            DataDisable(kPortIndex);

            if constexpr (kPortDirection == dmx::Direction::kOutput) {
                GPIO_BOP(kDirGpio[kPortIndex].port) = kDirGpio[kPortIndex].pin;
            } else if constexpr (kPortDirection == dmx::Direction::kInput) {
                GPIO_BC(kDirGpio[kPortIndex].port) = kDirGpio[kPortIndex].pin;
            } else {
                static_assert(false, "Invalid direction");
            }
        } else if constexpr (!kEnableData) {
            DataDisable(kPortIndex);
        }

        if constexpr (kEnableData) {
            DataEnable(kPortIndex);
        }
    }
}

void Dmx::DataEnable(uint32_t port_index) {
    DMX_DEBUG_PRINTF("port_index=%u", port_index);
    DMX_CHECK_PORT_INDEX_VOID(port_index);
    assert(sv_port_state[port_index] == dmx::PortState::kIdle);

    if (port_direction_[port_index] == dmx::Direction::kOutput) {
        sv_port_state[port_index] = dmx::PortState::kTx;
        s_DmxTxBuffer[port_index].state = dmx::TxRxState::kIdle;
        SetOutputStyle(port_index, GetOutputStyle(port_index));
        return;
    }

    if (port_direction_[port_index] == dmx::Direction::kInput) {
        sv_rx_buffer[port_index].state = dmx::TxRxState::kIdle;

        const auto kUart = std::to_underlying(kDirGpio[port_index].uart);

        do {
            __DMB();
        } while (!gd32::UartFlagGet<USART_FLAG_TBE>(kUart));

        gd32::UartInterruptFlagClear<USART_INT_FLAG_RBNE>(kUart);
        gd32::UartInterruptFlagClear<USART_INT_FLAG_IDLE>(kUart);
        gd32::UartInterruptEnable<USART_INT_RBNE>(kUart);
        gd32::UartInterruptEnable<USART_INT_FLAG_IDLE>(kUart);

        sv_port_state[port_index] = dmx::PortState::kRx;
        return;
    }

    assert(false && "Not reachable");
}

void Dmx::DataDisable(uint32_t port_index) {
    DMX_CHECK_PORT_INDEX_VOID(port_index);

    if (sv_port_state[port_index] == dmx::PortState::kIdle) {
        return;
    }

    sv_port_state[port_index] = dmx::PortState::kIdle;

    const auto kUart = std::to_underlying(kDirGpio[port_index].uart);

    if (port_direction_[port_index] == dmx::Direction::kOutput) {
        do {
            if (s_DmxTxBuffer[port_index].state == dmx::TxRxState::kDmxInter) {
                gd32::UartFlagClear<USART_FLAG_TC>(kUart);
                do {
                    __DMB();
                } while (!gd32::UartFlagGet<USART_FLAG_TC>(kUart));

                s_DmxTxBuffer[port_index].state = dmx::TxRxState::kIdle;
            }
        } while (s_DmxTxBuffer[port_index].state != dmx::TxRxState::kIdle);

        return;
    }

    if (port_direction_[port_index] == dmx::Direction::kInput) {
        gd32::UartInterruptDisable<USART_INT_RBNE>(kUart);
        gd32::UartInterruptDisable<USART_INT_FLAG_IDLE>(kUart);
        sv_rx_buffer[port_index].state = dmx::TxRxState::kIdle;
        return;
    }

    assert(false && "Not reachable");
}

void Dmx::ClearData(uint32_t port_index) {
    assert(port_index < dmx::config::max::kPorts);

    auto* data = &s_DmxTxBuffer[port_index].dmx.data[0];
    data->length = dmx::kSlotsMax; // Including START Code
    __builtin_memset(data->data, 0, dmx::buffer::kSize);
}

#if !defined(CONFIG_DMX_DISABLE_STATISTICS)
volatile dmx::TotalStatistics& Dmx::GetTotalStatistics(uint32_t port_index) {
    sv_total_statistics[port_index].dmx.received = sv_rx_dmx_packets[port_index].count;
    return sv_total_statistics[port_index];
}
#endif

void Dmx::Blackout() {
    DMX_DEBUG_ENTRY();

    for (uint32_t port_index = 0; port_index < dmx::config::max::kPorts; port_index++) {
        if (port_direction_[port_index] == dmx::Direction::kOutput) {
            DataDisable(port_index);
            ClearData(port_index);
            DataEnable(port_index);
        }
    }

    DMX_DEBUG_EXIT();
}

void Dmx::FullOn() {
    DMX_DEBUG_ENTRY();

    for (uint32_t port_index = 0; port_index < dmx::config::max::kPorts; port_index++) {
        if (port_direction_[port_index] == dmx::Direction::kOutput) {
            DataDisable(port_index);

            auto* __restrict__ data = &s_DmxTxBuffer[port_index].dmx.data[0];
            auto* __restrict__ p32 = reinterpret_cast<uint32_t*>(data->data);

            for (auto i = 0; i < dmx::buffer::kSize / 4; i++) {
                *p32++ = UINT32_MAX;
            }

            data->data[0] = dmx::kStartCode;
            data->length = dmx::kSlotsMax;

            DataEnable(port_index);
        }
    }

    DMX_DEBUG_EXIT();
}

// DMX Send
template <uint32_t kPortIndex, bool kHasStartCode, dmx::SendStyle kSendStyle> void Dmx::SetSendDataInternal(const uint8_t* data, uint32_t length) {
    static_assert(kPortIndex < dmx::config::max::kPorts);

    if constexpr (kDirGpio[kPortIndex].usage == dmx::port::Usage::kRxOnly) {
        return;
    }

    auto& tx_buffer = s_DmxTxBuffer[kPortIndex];
    const auto kHasDataPending = tx_buffer.dmx.read_index != tx_buffer.dmx.write_index;

    if (!kHasDataPending) {
        // No pending data — switch to the other buffer
        tx_buffer.dmx.write_index ^= 1;
    }

    const auto kWriteIndex = tx_buffer.dmx.write_index;

    auto* dst_data = tx_buffer.dmx.data[kWriteIndex].data;

    const auto kCappedLength = (length < transmit_slots_) ? length : transmit_slots_;
    tx_buffer.dmx.data[kWriteIndex].length = kCappedLength + 1;

    tx_buffer.dmx.data_pending = true;

    if constexpr (kHasStartCode) {
        memcpy(dst_data, data, kCappedLength);
    } else {
        dst_data[0] = dmx::kStartCode;
        memcpy(&dst_data[1], data, kCappedLength);
    }

    if (kCappedLength != transmit_length_[kPortIndex]) {
        transmit_length_[kPortIndex] = kCappedLength;
        SetTransmitPeriodTime(transmit_period_requested_);
    }

    if constexpr (kSendStyle == dmx::SendStyle::kDirect) {
        StartSendStyleDirect(kPortIndex);
    }
}

void Dmx::StartSendStyleDirect(uint32_t port_index) {
    DMX_CHECK_PORT_INDEX_VOID(port_index);

    if ((sv_port_state[port_index] == dmx::PortState::kTx) && (s_DmxTxBuffer[port_index].output_style == dmx::OutputStyle::kDelta) && (s_DmxTxBuffer[port_index].state == dmx::TxRxState::kIdle)) {
        StartDmxOutput(port_index);
    }
}

template <uint32_t kPortIndex> void StartDmxOutputBreak() {
    if constexpr ((kDirGpio[kPortIndex].port == 0) && (kDirGpio[kPortIndex].pin == 0)) {
        return;
    }

    constexpr auto kUsartPeripheral = std::to_underlying(kDirGpio[kPortIndex].uart);

