vanvught/GD32F303RC-DMX512-RDM/lib-dmx/src/gd32/dmx.cpp
    // USART_FLAG_TC is set after power on.
    // The flag is cleared by DMA interrupt when maximum slots - 1 are transmitted.
    // TODO(a): Do we need a timeout just to be safe?
    while (SET != usart_flag_get(kUsartPeripheral, USART_FLAG_TC)) {
    }

    switch (kUsartPeripheral) {
// TIMER 1
#if defined(DMX_USE_USART0)
        case USART0:
            Gd32GpioModeOutput<USART0_GPIOx, USART0_TX_GPIO_PINx>();
            GPIO_BC(USART0_GPIOx) = USART0_TX_GPIO_PINx;
            TIMER_CH0CV(TIMER1) = TIMER_CNT(TIMER1) + s_dmx_transmit.break_time;
            s_DmxTxBuffer[kPortIndex].state = dmx::TxRxState::kDmxBreak;
            return;
            break;
#endif // defined(DMX_USE_USART0)
#if defined(DMX_USE_USART1)
        case USART1:
            Gd32GpioModeOutput<USART1_GPIOx, USART1_TX_GPIO_PINx>();
            GPIO_BC(USART1_GPIOx) = USART1_TX_GPIO_PINx;
            TIMER_CH1CV(TIMER1) = TIMER_CNT(TIMER1) + s_dmx_transmit.break_time;
            s_DmxTxBuffer[kPortIndex].state = dmx::TxRxState::kDmxBreak;
            return;
            break;
#endif // defined(DMX_USE_USART1)
#if defined(DMX_USE_USART2)
        case USART2:
            Gd32GpioModeOutput<USART2_GPIOx, USART2_TX_GPIO_PINx>();
            GPIO_BC(USART2_GPIOx) = USART2_TX_GPIO_PINx;
            TIMER_CH2CV(TIMER1) = TIMER_CNT(TIMER1) + s_dmx_transmit.break_time;
            s_DmxTxBuffer[kPortIndex].state = dmx::TxRxState::kDmxBreak;
            return;
            break;
#endif // defined(DMX_USE_USART2)
#if defined(DMX_USE_UART3)
        case UART3:
            Gd32GpioModeOutput<UART3_GPIOx, UART3_TX_GPIO_PINx>();
            GPIO_BC(UART3_GPIOx) = UART3_TX_GPIO_PINx;
            TIMER_CH3CV(TIMER1) = TIMER_CNT(TIMER1) + s_dmx_transmit.break_time;
            s_DmxTxBuffer[kPortIndex].state = dmx::TxRxState::kDmxBreak;
            return;
            break;
#endif // defined(DMX_USE_UART3)
// TIMER 4
#if defined(DMX_USE_UART4)
        case UART4:
            Gd32GpioModeOutput<UART4_TX_GPIOx, UART4_TX_GPIO_PINx>();
            GPIO_BC(UART4_TX_GPIOx) = UART4_TX_GPIO_PINx;
            TIMER_CH0CV(TIMER4) = TIMER_CNT(TIMER4) + s_dmx_transmit.break_time;
            s_DmxTxBuffer[kPortIndex].state = dmx::TxRxState::kDmxBreak;
            return;
            break;
#endif // defined(DMX_USE_UART4)
#if defined(DMX_USE_USART5)
        case USART5:
            Gd32GpioModeOutput<USART5_GPIOx, USART5_TX_GPIO_PINx>();
            GPIO_BC(USART5_GPIOx) = USART5_TX_GPIO_PINx;
            TIMER_CH1CV(TIMER4) = TIMER_CNT(TIMER4) + s_dmx_transmit.break_time;
            s_DmxTxBuffer[kPortIndex].state = dmx::TxRxState::kDmxBreak;
            return;
            break;
#endif
#if defined(DMX_USE_UART6)
        case UART6:
            Gd32GpioModeOutput<UART6_GPIOx, UART6_TX_GPIO_PINx>();
            GPIO_BC(UART6_GPIOx) = UART6_TX_GPIO_PINx;
            TIMER_CH2CV(TIMER4) = TIMER_CNT(TIMER4) + s_dmx_transmit.break_time;
            s_DmxTxBuffer[kPortIndex].state = dmx::TxRxState::kDmxBreak;
            return;
            break;
#endif // defined(DMX_USE_UART6)
#if defined(DMX_USE_UART7)
        case UART7:
            Gd32GpioModeOutput<UART7_GPIOx, UART7_TX_GPIO_PINx>();
            GPIO_BC(UART7_GPIOx) = UART7_TX_GPIO_PINx;
            TIMER_CH3CV(TIMER4) = TIMER_CNT(TIMER4) + s_dmx_transmit.break_time;
            s_DmxTxBuffer[kPortIndex].state = dmx::TxRxState::kDmxBreak;
            return;
            break;
#endif // defined(DMX_USE_UART7)
        default:
            [[unlikely]] assert(false && "switch");
            break;
    }

    assert(false && "Not reachable");
}

template <uint32_t kPortIndex> void StartDmxOutputPort() {
    if constexpr (kPortIndex < dmx::config::max::kPorts) {
        if constexpr (kDirGpio[kPortIndex].usage != dmx::port::Usage::kRxOnly) {
            StartDmxOutputBreak<kPortIndex>();
        }
    }
}

void Dmx::StartDmxOutput(uint32_t port_index) {
    assert(port_index < dmx::config::max::kPorts);

    switch (port_index) {
        case 0:
            StartDmxOutputPort<0>();
            break;
#if DMX_MAX_PORTS >= 2
        case 1:
            StartDmxOutputPort<1>();
            break;
#endif
#if DMX_MAX_PORTS >= 3
        case 2:
            StartDmxOutputPort<2>();
            break;
#endif
#if DMX_MAX_PORTS >= 4
        case 3:
            StartDmxOutputPort<3>();
            break;
#endif
#if DMX_MAX_PORTS >= 5
        case 4:
            StartDmxOutputPort<4>();
            break;
#endif
#if DMX_MAX_PORTS >= 6
        case 5:
            StartDmxOutputPort<5>();
            break;
#endif
#if DMX_MAX_PORTS >= 7
        case 6:
            StartDmxOutputPort<6>();
            break;
#endif
#if DMX_MAX_PORTS >= 8
        case 7:
            StartDmxOutputPort<7>();
            break;
#endif
        default:
            [[unlikely]] break;
    }
}

// RDM DMA Send
#define RDM_HANDLE_SEND_CASE(i) \
    case i:                     \
        return RdmSendDataInternal<i>(data, length)

void Dmx::RdmTransmit(uint32_t port_index, const uint8_t* data, uint32_t length) {
    switch (port_index) {
        RDM_HANDLE_SEND_CASE(0);
#if DMX_MAX_PORTS >= 2
        RDM_HANDLE_SEND_CASE(1);
#endif
#if DMX_MAX_PORTS >= 3
        RDM_HANDLE_SEND_CASE(2);
#endif
#if DMX_MAX_PORTS >= 4
        RDM_HANDLE_SEND_CASE(3);
#endif
#if DMX_MAX_PORTS >= 5
        RDM_HANDLE_SEND_CASE(4);
#endif
#if DMX_MAX_PORTS >= 6
        RDM_HANDLE_SEND_CASE(5);
#endif
#if DMX_MAX_PORTS >= 7
        RDM_HANDLE_SEND_CASE(6);
#endif
#if DMX_MAX_PORTS == 8
        RDM_HANDLE_SEND_CASE(7);
#endif
        default:
            [[unlikely]] assert(false && "switch");
            return;
    }
}

template <uint32_t kPortIndex> void Dmx::RdmSendDataInternal(const uint8_t* data, uint32_t length) {
    static_assert(kPortIndex < dmx::config::max::kPorts);

    if constexpr (kDirGpio[kPortIndex].usage == dmx::port::Usage::kRxOnly) {
        return;
    }

    assert(data != nullptr);
    assert(length <= sizeof(TRdmMessage));

    SetPortDirection<kPortIndex, dmx::Direction::kOutput, false>();

    auto& tx_buffer = s_RdmTxBuffer[kPortIndex];

    auto* dst_data = tx_buffer.rdm.data.data;
    auto& dst_length = tx_buffer.rdm.data.length;
    dst_length = length;

    memcpy(dst_data, data, length);

    StartRdmOutput(kPortIndex);
}

template <uint32_t kPortIndex> void StartRdmOutput() {
    static_assert(kPortIndex < dmx::config::max::kPorts);

