vanvught/GD32F303RC-DMX512-RDM/lib-dmx/src/gd32/dmx.cpp
        for (size_t i = 0; i < dmx::buffer::kSize / 4; ++i) {
            dst32[i] = src32[i];
        }

        return p;
    }
#else
    const auto* __restrict__ src32 = reinterpret_cast<const volatile uint32_t*>(sv_rx_buffer[port_index].dmx.current.data);
    auto* __restrict__ dst32 = reinterpret_cast<volatile uint32_t*>(sv_rx_buffer[port_index].dmx.previous.data);

    if (sv_rx_buffer[port_index].dmx.current.slots_in_packet != sv_rx_buffer[port_index].dmx.previous.slots_in_packet) {
        sv_rx_buffer[port_index].dmx.previous.slots_in_packet = sv_rx_buffer[port_index].dmx.current.slots_in_packet;

        for (size_t i = 0; i < dmx::buffer::kSize / 4; ++i) {
            dst32[i] = src32[i];
        }

        return p;
    }
#endif

    bool is_changed = false;

    for (size_t i = 0; i < dmx::buffer::kSize / 4; ++i) {
        const auto kSrcValue = src32[i];
        auto dst_value = dst32[i];

        if (kSrcValue != dst_value) {
            dst32[i] = kSrcValue;
            is_changed = true;
        }
    }

    return (is_changed ? p : nullptr);
#else
    return nullptr;
#endif
}

const uint8_t* Dmx::GetDmxAvailable([[maybe_unused]] uint32_t port_index) {
    DMX_CHECK_PORT_INDEX_VOID(port_index);
#if !defined(CONFIG_DMX_TRANSMIT_ONLY)
#if defined(CONFIG_DMX_DOUBLE_INPUT_BUFFER)
    auto& dmx_data_buffer = GetReadDmxDataBuffer(port_index);

    auto slots_in_packet = dmx_data_buffer.slots_in_packet;

    if (!(slots_in_packet & dmx::kDmxSlotsCompleteFlag)) {
        return nullptr;
    }

    slots_in_packet &= ~dmx::kDmxSlotsCompleteFlag;
    slots_in_packet--; // Remove SC from length
    dmx_data_buffer.slots_in_packet = slots_in_packet;

    return const_cast<const uint8_t*>(dmx_data_buffer.data);
#else
    auto slots_in_packet = sv_rx_buffer[port_index].dmx.current.slots_in_packet;

    if ((slots_in_packet & 0x8000) != 0x8000) {
        return nullptr;
    }

    slots_in_packet &= static_cast<uint32_t>(~0x8000);
    slots_in_packet--; // Remove SC from length
    sv_rx_buffer[port_index].dmx.current.slots_in_packet = slots_in_packet;

    return const_cast<const uint8_t*>(sv_rx_buffer[port_index].dmx.current.data);
#endif
#else
    return nullptr;
#endif
}

const uint8_t* Dmx::GetDmxCurrentData(uint32_t port_index) {
#if defined(CONFIG_DMX_DOUBLE_INPUT_BUFFER)
    return const_cast<const uint8_t*>(GetReadDmxDataBuffer(port_index).data);
#else
    return const_cast<const uint8_t*>(sv_rx_buffer[port_index].dmx.current.data);
#endif
}

uint32_t Dmx::GetDmxUpdatesPerSecond([[maybe_unused]] uint32_t port_index) {
    DMX_CHECK_PORT_INDEX_RET(port_index, 0);
#if !defined(CONFIG_DMX_TRANSMIT_ONLY)
    return sv_rx_dmx_packets[port_index].per_second;
#else
    return 0;
#endif
}

// RDM Send Discovery Response Message
void Dmx::RdmTransmitDiscoveryRespondMessage(uint32_t port_index, const uint8_t* data, uint32_t length) {
    DMX_CHECK_PORT_INDEX_VOID(port_index);
    assert(data != nullptr);
    assert(length != 0);

    // 3.2.2 Responder Packet spacing
    timing::DelayUs(rdm::responder::kPacketSpacing, gsv_rdm_data_receive_end[port_index]);

    SetPortDirection(port_index, dmx::Direction::kOutput, false);

    const auto kUart = std::to_underlying(kDirGpio[port_index].uart);

    for (uint32_t i = 0; i < length; i++) {
        do {
            __DMB();
        } while (!gd32::UartFlagGet<USART_FLAG_TBE>(kUart));

        USART_TDATA(kUart) = USART_TDATA_TDATA & data[i];
    }

    while (!gd32::UartFlagGet<USART_FLAG_TC>(kUart)) {
        static_cast<void>(GET_BITS(USART_RDATA(kUart), 0U, 8U));
    }

    TIMER_CNT(TIMER5) = 0;
    do {
        __DMB();
    } while (TIMER_CNT(TIMER5) < rdm::responder::kDataDirectionDelay);

    SetPortDirection(port_index, dmx::Direction::kInput, true);

#if !defined(CONFIG_DMX_DISABLE_STATISTICS)
    sv_total_statistics[port_index].rdm.sent.discovery_response = sv_total_statistics[port_index].rdm.sent.discovery_response + 1;
#endif
}

// RDM Receive
const uint8_t* Dmx::RdmReceive(uint32_t port_index) {
    DMX_CHECK_PORT_INDEX_PTR(port_index);

    if ((sv_rx_buffer[port_index].rdm.index & dmx::kRdmSlotsCompleteFlag) != dmx::kRdmSlotsCompleteFlag) {
        return nullptr;
    }

    sv_rx_buffer[port_index].rdm.index = 0;

    const auto* data = const_cast<const uint8_t*>(sv_rx_buffer[port_index].rdm.data);

    if (data[0] == E120_SC_RDM) {
        const auto* rdm_command = reinterpret_cast<const struct TRdmMessage*>(data);

        uint32_t index;
        uint16_t checksum = 0;

        for (index = 0; index < e120::kMessageLengthMin; index++) {
            checksum = static_cast<uint16_t>(checksum + data[index]);
        }

        for (; index < rdm_command->message_length; index++) {
            checksum = static_cast<uint16_t>(checksum + data[index]);
        }

        if (data[index++] == static_cast<uint8_t>(checksum >> 8)) {
            if (data[index] == static_cast<uint8_t>(checksum)) {
#if !defined(CONFIG_DMX_DISABLE_STATISTICS)
                sv_total_statistics[port_index].rdm.received.good = sv_total_statistics[port_index].rdm.received.good + 1;
#endif
                return data;
            }
        }
#if !defined(CONFIG_DMX_DISABLE_STATISTICS)
        sv_total_statistics[port_index].rdm.received.bad = sv_total_statistics[port_index].rdm.received.bad + 1;
#endif
        return nullptr;
    }

#if !defined(CONFIG_DMX_DISABLE_STATISTICS)
    sv_total_statistics[port_index].rdm.received.discovery_response = sv_total_statistics[port_index].rdm.received.discovery_response + 1;
#endif

    return data;
}

// RDM Receive with timeout
// NOLINTNEXTLINE(bugprone-easily-swappable-parameters)
const uint8_t* Dmx::RdmReceiveTimeOut(uint32_t port_index, uint16_t timeout_ms) {
    DMX_CHECK_PORT_INDEX_PTR(port_index);

    uint8_t* data_available = nullptr;
    TIMER_CNT(TIMER5) = 0;

    do {
        data_available = const_cast<uint8_t*>(RdmReceive(port_index));
        if (data_available != nullptr) {
            return data_available;
        }
    } while (TIMER_CNT(TIMER5) < timeout_ms);

    return nullptr;
}

// Explicit template instantiations
template void Dmx::SetTransmitDataWithSC<dmx::SendStyle::kDirect>(const uint32_t, const uint8_t*, uint32_t);
template void Dmx::SetTransmitDataWithSC<dmx::SendStyle::kSync>(const uint32_t, const uint8_t*, uint32_t);

template void Dmx::SetTransmitDataWithoutSC<dmx::SendStyle::kDirect>(const uint32_t, const uint8_t*, uint32_t);
template void Dmx::SetTransmitDataWithoutSC<dmx::SendStyle::kSync>(const uint32_t, const uint8_t*, uint32_t);

