vanvught/GD32F303RC-DMX512-RDM/lib-dmx/src/gd32/dmx.cpp
template void Dmx::SetSendDataInternal<0, true, dmx::SendStyle::kDirect>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<0, true, dmx::SendStyle::kSync>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<0, false, dmx::SendStyle::kDirect>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<0, false, dmx::SendStyle::kSync>(const uint8_t*, uint32_t);

#if DMX_MAX_PORTS >= 2
template void Dmx::SetSendDataInternal<1, true, dmx::SendStyle::kDirect>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<1, true, dmx::SendStyle::kSync>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<1, false, dmx::SendStyle::kDirect>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<1, false, dmx::SendStyle::kSync>(const uint8_t*, uint32_t);
#endif

#if DMX_MAX_PORTS >= 3
template void Dmx::SetSendDataInternal<2, true, dmx::SendStyle::kDirect>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<2, true, dmx::SendStyle::kSync>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<2, false, dmx::SendStyle::kDirect>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<2, false, dmx::SendStyle::kSync>(const uint8_t*, uint32_t);
#endif

#if DMX_MAX_PORTS >= 4
template void Dmx::SetSendDataInternal<3, true, dmx::SendStyle::kDirect>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<3, true, dmx::SendStyle::kSync>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<3, false, dmx::SendStyle::kDirect>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<3, false, dmx::SendStyle::kSync>(const uint8_t*, uint32_t);
#endif

#if DMX_MAX_PORTS >= 5
template void Dmx::SetSendDataInternal<4, true, dmx::SendStyle::kDirect>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<4, true, dmx::SendStyle::kSync>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<4, false, dmx::SendStyle::kDirect>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<4, false, dmx::SendStyle::kSync>(const uint8_t*, uint32_t);
#endif

#if DMX_MAX_PORTS >= 6
template void Dmx::SetSendDataInternal<5, true, dmx::SendStyle::kDirect>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<5, true, dmx::SendStyle::kSync>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<5, false, dmx::SendStyle::kDirect>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<5, false, dmx::SendStyle::kSync>(const uint8_t*, uint32_t);
#endif

#if DMX_MAX_PORTS >= 7
template void Dmx::SetSendDataInternal<6, true, dmx::SendStyle::kDirect>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<6, true, dmx::SendStyle::kSync>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<6, false, dmx::SendStyle::kDirect>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<6, false, dmx::SendStyle::kSync>(const uint8_t*, uint32_t);
#endif

#if DMX_MAX_PORTS == 8
template void Dmx::SetSendDataInternal<7, true, dmx::SendStyle::kDirect>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<7, true, dmx::SendStyle::kSync>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<7, false, dmx::SendStyle::kDirect>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<7, false, dmx::SendStyle::kSync>(const uint8_t*, uint32_t);
#endif

#if !defined(CONFIG_DMX_NO_OPTIMIZE)
#pragma GCC pop_options
#endif
#pragma GCC push_options
#pragma GCC optimize("Os")
// Configuration
[[gnu::noinline]]
void Dmx::SetTransmitBreakTime(uint32_t break_time) {
    s_dmx_transmit.break_time = common::Max(dmx::transmit::kBreakTimeMin, break_time);
    SetTransmitPeriodTime(transmit_period_requested_);
}

[[gnu::noinline]]
uint32_t Dmx::TransmitBreakTime() const {
    return s_dmx_transmit.break_time;
}

[[gnu::noinline]]
void Dmx::SetTransmitMabTime(uint32_t mab_time) {
    s_dmx_transmit.mab_time = common::Max(dmx::transmit::kMabTimeMin, mab_time);
    SetTransmitPeriodTime(transmit_period_requested_);
}

[[gnu::noinline]]
uint32_t Dmx::TransmitMabTime() const {
    return s_dmx_transmit.mab_time;
}

[[gnu::noinline]]
void Dmx::SetTransmitPeriodTime(uint32_t period) {
    transmit_period_requested_ = period;

    auto length_max = s_DmxTxBuffer[0].dmx.data[0].length;

    for (uint32_t port_index = 1; port_index < dmx::config::max::kPorts; port_index++) {
        const auto kLength = s_DmxTxBuffer[port_index].dmx.data[0].length;
        if (kLength > length_max) {
            length_max = kLength;
        }
    }

    auto package_length_micro_seconds = s_dmx_transmit.break_time + s_dmx_transmit.mab_time + (length_max * dmx::kSlotTime);

    // The GD32F4xx/GD32H7XX Timer 1 has a 32-bit counter
#if defined(GD32F4XX) || defined(GD32H7XX)
#else
    if (package_length_micro_seconds > (UINT16_MAX - dmx::kSlotTime)) {
        s_dmx_transmit.break_time = common::Min(dmx::transmit::kBreakTimeTypical, s_dmx_transmit.break_time);
        s_dmx_transmit.mab_time = dmx::transmit::kMabTimeMin;
        package_length_micro_seconds = s_dmx_transmit.break_time + s_dmx_transmit.mab_time + (length_max * dmx::kSlotTime);
    }
#endif

    if (period != 0) {
        if (period < package_length_micro_seconds) {
            transmit_period_ = common::Max(dmx::transmit::kBreakToBreakTimeMin, package_length_micro_seconds + dmx::kSlotTime);
        } else {
            transmit_period_ = period;
        }
    } else {
        transmit_period_ = common::Max(dmx::transmit::kBreakToBreakTimeMin, package_length_micro_seconds + dmx::kSlotTime);
    }

    s_dmx_transmit.inter_time = transmit_period_ - package_length_micro_seconds;

    DMX_DEBUG_PRINTF("period=%u, nLengthMax=%u, m_nDmxTransmitPeriod=%u, nPackageLengthMicroSeconds=%u -> s_dmx_transmit.inter_time=%u", period, length_max, transmit_period_, package_length_micro_seconds, s_dmx_transmit.inter_time);
}

[[gnu::noinline]]
void Dmx::SetTransmitSlots(uint16_t slots) {
    if ((slots >= 2) && (slots <= dmx::kChannelsMax)) {
        transmit_slots_ = slots;

        for (uint32_t i = 0; i < dmx::config::max::kPorts; i++) {
            transmit_length_[i] = static_cast<uint32_t>(slots);
        }

        SetTransmitPeriodTime(transmit_period_requested_);
    }
}

[[gnu::noinline]]
void Dmx::SetOutputStyle(uint32_t port_index, dmx::OutputStyle output_style) {
    DMX_CHECK_PORT_INDEX_VOID(port_index);

