vanvught/GD32F303RC-DMX512-RDM/lib-dmx/src/gd32/dmx.cpp
    s_DmxTxBuffer[port_index].output_style = output_style;

    if (output_style == dmx::OutputStyle::kConstant) {
        if (!has_continuous_output_) {
            has_continuous_output_ = true;
            if (port_direction_[port_index] == dmx::Direction::kOutput) {
                StartDmxOutput(port_index);
            }
            return;
        }

        for (uint32_t index = 0; index < dmx::config::max::kPorts; index++) {
            if ((s_DmxTxBuffer[index].output_style == dmx::OutputStyle::kConstant) && (port_direction_[index] == dmx::Direction::kOutput)) {
                DataDisable(index);
            }
        }

        for (uint32_t index = 0; index < dmx::config::max::kPorts; index++) {
            if ((s_DmxTxBuffer[index].output_style == dmx::OutputStyle::kConstant) && (port_direction_[index] == dmx::Direction::kOutput)) {
                StartDmxOutput(index);
            }
        }
    } else {
        has_continuous_output_ = false;
        for (uint32_t index = 0; index < dmx::config::max::kPorts; index++) {
            if (s_DmxTxBuffer[index].output_style == dmx::OutputStyle::kConstant) {
                has_continuous_output_ = true;
                return;
            }
        }
    }
}

[[gnu::noinline]]
dmx::OutputStyle Dmx::GetOutputStyle(uint32_t port_index) const {
    DMX_CHECK_PORT_INDEX_RET(port_index, dmx::OutputStyle::kConstant);
    return s_DmxTxBuffer[port_index].output_style;
}

// Setup
static void UartDmxConfig(uint32_t usart_periph) {
    gd32::UartBegin(usart_periph, 250000U, gd32::kUartBits8, gd32::kUartParityNone, gd32::kUartStop2Bits);
}

static void UsartDmaConfig() {
    DMA_PARAMETER_STRUCT dma_init_struct;
    rcu_periph_clock_enable(RCU_DMA0);
    rcu_periph_clock_enable(RCU_DMA1);
#if defined(GD32H7XX)
    rcu_periph_clock_enable(RCU_DMAMUX);
#endif

#if defined(DMX_USE_USART0)
    // USART 0 TX
    dma_deinit(USART0_DMAx, USART0_TX_DMA_CHx);
#if defined(GD32H7XX)
    dma_init_struct.request = DMA_REQUEST_USART0_TX;
#endif
    dma_init_struct.direction = DMA_MEMORY_TO_PERIPHERAL;
    dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
#if defined(GD32F4XX) || defined(GD32H7XX)
#else
    dma_init_struct.memory_width = DMA_MEMORY_WIDTH_8BIT;
#endif
    dma_init_struct.periph_addr = reinterpret_cast<uint32_t>(&USART_TDATA(USART0));
    dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
#if defined(GD32F4XX) || defined(GD32H7XX)
    dma_init_struct.periph_memory_width = DMA_PERIPHERAL_WIDTH_8BIT;
#else
    dma_init_struct.periph_width = DMA_PERIPHERAL_WIDTH_8BIT;
#endif
    dma_init_struct.priority = DMA_PRIORITY_HIGH;
    dma_init(USART0_DMAx, USART0_TX_DMA_CHx, &dma_init_struct);
    /* configure DMA mode */
    dma_circulation_disable(USART0_DMAx, USART0_TX_DMA_CHx);
    dma_memory_to_memory_disable(USART0_DMAx, USART0_TX_DMA_CHx);
#if defined(GD32F4XX)
    dma_channel_subperipheral_select(USART0_DMAx, USART0_TX_DMA_CHx, USART0_TX_DMA_SUBPERIx);
#endif
    Gd32DmaInterruptDisable<USART0_DMAx, USART0_TX_DMA_CHx, DMA_INTERRUPT_DISABLE>();
#if !defined(GD32F4XX)
    NVIC_SetPriority(DMA0_Channel3_IRQn, 1);
    NVIC_EnableIRQ(DMA0_Channel3_IRQn);
#else
    NVIC_SetPriority(DMA1_Channel7_IRQn, 1);
    NVIC_EnableIRQ(DMA1_Channel7_IRQn);
#endif
#endif // DMX_USE_USART0

#if defined(DMX_USE_USART1)
    // USART 1 TX
    dma_deinit(USART1_DMAx, USART1_TX_DMA_CHx);
#if defined(GD32H7XX)
    dma_init_struct.request = DMA_REQUEST_USART1_TX;
#endif
    dma_init_struct.direction = DMA_MEMORY_TO_PERIPHERAL;
    dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
#if defined(GD32F4XX) || defined(GD32H7XX)
#else
    dma_init_struct.memory_width = DMA_MEMORY_WIDTH_8BIT;
#endif
    dma_init_struct.periph_addr = reinterpret_cast<uint32_t>(&USART_TDATA(USART1));
    dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
#if defined(GD32F4XX) || defined(GD32H7XX)
    dma_init_struct.periph_memory_width = DMA_PERIPHERAL_WIDTH_8BIT;
#else
    dma_init_struct.periph_width = DMA_PERIPHERAL_WIDTH_8BIT;
#endif
    dma_init_struct.priority = DMA_PRIORITY_HIGH;
    dma_init(USART1_DMAx, USART1_TX_DMA_CHx, &dma_init_struct);
    /* configure DMA mode */
    dma_circulation_disable(USART1_DMAx, USART1_TX_DMA_CHx);
    dma_memory_to_memory_disable(USART1_DMAx, USART1_TX_DMA_CHx);
#if defined(GD32F4XX)
    dma_channel_subperipheral_select(USART1_DMAx, USART1_TX_DMA_CHx, USART1_TX_DMA_SUBPERIx);
#endif
    Gd32DmaInterruptDisable<USART1_DMAx, USART1_TX_DMA_CHx, DMA_INTERRUPT_DISABLE>();
    NVIC_SetPriority(DMA0_Channel6_IRQn, 1);
    NVIC_EnableIRQ(DMA0_Channel6_IRQn);
#endif // DMX_USE_USART1

#if defined(DMX_USE_USART2)
    // USART 2 TX
    dma_deinit(USART2_DMAx, USART2_TX_DMA_CHx);
#if defined(GD32H7XX)
    dma_init_struct.request = DMA_REQUEST_USART2_TX;
#endif
    dma_init_struct.direction = DMA_MEMORY_TO_PERIPHERAL;
    dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
#if defined(GD32F4XX) || defined(GD32H7XX)
#else
    dma_init_struct.memory_width = DMA_MEMORY_WIDTH_8BIT;
#endif
    dma_init_struct.periph_addr = reinterpret_cast<uint32_t>(&USART_TDATA(USART2));
    dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
#if defined(GD32F4XX) || defined(GD32H7XX)
    dma_init_struct.periph_memory_width = DMA_PERIPHERAL_WIDTH_8BIT;
#else
    dma_init_struct.periph_width = DMA_PERIPHERAL_WIDTH_8BIT;
#endif
    dma_init_struct.priority = DMA_PRIORITY_HIGH;
    dma_init(USART2_DMAx, USART2_TX_DMA_CHx, &dma_init_struct);
    /* configure DMA mode */
    dma_circulation_disable(USART2_DMAx, USART2_TX_DMA_CHx);
    dma_memory_to_memory_disable(USART2_DMAx, USART2_TX_DMA_CHx);
#if defined(GD32F4XX)
    dma_channel_subperipheral_select(USART2_DMAx, USART2_TX_DMA_CHx, USART2_TX_DMA_SUBPERIx);
#endif
    Gd32DmaInterruptDisable<USART2_DMAx, USART2_TX_DMA_CHx, DMA_INTERRUPT_DISABLE>();
#if defined(GD32F4XX) || defined(GD32H7XX)
    NVIC_SetPriority(DMA0_Channel3_IRQn, 1);
    NVIC_EnableIRQ(DMA0_Channel3_IRQn);
#else
    NVIC_SetPriority(DMA0_Channel1_IRQn, 1);
    NVIC_EnableIRQ(DMA0_Channel1_IRQn);
#endif
#endif // DMX_USE_USART2

