vanvught/GD32F303RC-DMX512-RDM/lib-dmx/src/gd32/dmx.cpp
#if defined(DMX_USE_USART1)
    timer_channel_output_mode_config(TIMER1, TIMER_CH_1, TIMER_OC_MODE_ACTIVE);
    TIMER_CH1CV(TIMER1) = UINT32_MAX;
    timer_interrupt_enable(TIMER1, TIMER_INT_CH1);
#endif // DMX_USE_USART1

#if defined(DMX_USE_USART2)
    timer_channel_output_mode_config(TIMER1, TIMER_CH_2, TIMER_OC_MODE_ACTIVE);
    TIMER_CH2CV(TIMER1) = UINT32_MAX;
    timer_interrupt_enable(TIMER1, TIMER_INT_CH2);
#endif // DMX_USE_USART2

#if defined(DMX_USE_UART3)
    timer_channel_output_mode_config(TIMER1, TIMER_CH_3, TIMER_OC_MODE_ACTIVE);
    TIMER_CH3CV(TIMER1) = UINT32_MAX;
    timer_interrupt_enable(TIMER1, TIMER_INT_CH3);
#endif // DMX_USE_UART3

    NVIC_SetPriority(TIMER1_IRQn, 0);
    NVIC_EnableIRQ(TIMER1_IRQn);

    timer_enable(TIMER1);
}

#if defined(DMX_USE_UART4) || defined(DMX_USE_USART5) || defined(DMX_USE_UART6) || defined(DMX_USE_UART7)
static void Timer4Config() {
    rcu_periph_clock_enable(RCU_TIMER4);
    timer_deinit(TIMER4);

    timer_parameter_struct timer_initpara;
    timer_struct_para_init(&timer_initpara);

    timer_initpara.prescaler = TIMER_PSC_1MHZ;
    timer_initpara.alignedmode = TIMER_COUNTER_EDGE;
    timer_initpara.counterdirection = TIMER_COUNTER_UP;
    timer_initpara.period = UINT32_MAX;
    timer_initpara.clockdivision = TIMER_CKDIV_DIV1;
    timer_initpara.repetitioncounter = 0;
    timer_init(TIMER4, &timer_initpara);

    timer_flag_clear(TIMER4, UINT32_MAX);
    timer_interrupt_flag_clear(TIMER4, UINT32_MAX);

#if defined(DMX_USE_UART4)
    timer_channel_output_mode_config(TIMER4, TIMER_CH_0, TIMER_OC_MODE_ACTIVE);
    TIMER_CH0CV(TIMER4) = UINT32_MAX;
    timer_interrupt_enable(TIMER4, TIMER_INT_CH0);
#endif // DMX_USE_UART4

#if defined(DMX_USE_USART5)
    timer_channel_output_mode_config(TIMER4, TIMER_CH_1, TIMER_OC_MODE_ACTIVE);
    TIMER_CH1CV(TIMER4) = UINT32_MAX;
    timer_interrupt_enable(TIMER4, TIMER_INT_CH1);
#endif // DMX_USE_USART5

#if defined(DMX_USE_UART6)
    timer_channel_output_mode_config(TIMER4, TIMER_CH_2, TIMER_OC_MODE_ACTIVE);
    TIMER_CH2CV(TIMER4) = UINT32_MAX;
    timer_interrupt_enable(TIMER4, TIMER_INT_CH2);
#endif // DMX_USE_UART6

#if defined(DMX_USE_UART7)
    timer_channel_output_mode_config(TIMER4, TIMER_CH_3, TIMER_OC_MODE_ACTIVE);
    TIMER_CH3CV(TIMER4) = UINT32_MAX;
    timer_interrupt_enable(TIMER4, TIMER_INT_CH3);
#endif // DMX_USE_UART7

    NVIC_SetPriority(TIMER4_IRQn, 0);
    NVIC_EnableIRQ(TIMER4_IRQn);

    timer_enable(TIMER4);
}
#endif

Dmx::Dmx() {
    DMX_DEBUG_ENTRY();
    assert(s_this == nullptr);
    s_this = this;

    s_dmx_transmit.break_time = dmx::transmit::kBreakTimeTypical;
    s_dmx_transmit.mab_time = dmx::transmit::kMabTimeMin;
    s_dmx_transmit.inter_time = dmx::transmit::kPeriodDefault - s_dmx_transmit.break_time - s_dmx_transmit.mab_time - (dmx::kChannelsMax * dmx::kSlotTime) - dmx::kSlotTime;

    for (uint32_t port_index = 0; port_index < dmx::config::max::kPorts; port_index++) {
        transmit_length_[port_index] = dmx::kChannelsMax;
        sv_rx_buffer[port_index].state = dmx::TxRxState::kIdle;
        s_DmxTxBuffer[port_index].state = dmx::TxRxState::kIdle;

        if ((kDirGpio[port_index].port != 0) && (kDirGpio[port_index].pin != 0)) {
            Gd32GpioFsel(kDirGpio[port_index].port, kDirGpio[port_index].pin, GPIO_FSEL_OUTPUT);
            SetPortDirection(port_index, dmx::Direction::kInput, false);
        }

        SetOutputStyle(port_index, dmx::OutputStyle::kDelta);
        ClearData(port_index);
    }

    SetTransmitBreakTime(dmx::transmit::kBreakTimeTypical);
    SetTransmitMabTime(dmx::transmit::kMabTimeMin);
    SetTransmitSlots(dmx::kChannelsMax);
    SetTransmitPeriodTime(0);

    UsartDmaConfig(); // DMX Transmit
#if defined(DMX_USE_USART0) || defined(DMX_USE_USART1) || defined(DMX_USE_USART2) || defined(DMX_USE_UART3)
    Timer1Config(); // DMX Transmit -> USART0, USART1, USART2, UART3
#endif
#if defined(DMX_USE_UART4) || defined(DMX_USE_USART5) || defined(DMX_USE_UART6) || defined(DMX_USE_UART7)
    Timer4Config(); // DMX Transmit -> UART4, USART5, UART6, UART7
#endif

#if defined(DMX_USE_USART0) || defined(DMX_USE_USART0_RX)
    UartDmxConfig(USART0);
    NVIC_SetPriority(USART0_IRQn, 0);
    NVIC_EnableIRQ(USART0_IRQn);
#endif
#if defined(DMX_USE_USART1) || defined(DMX_USE_USART1_RX)
    UartDmxConfig(USART1);
    NVIC_SetPriority(USART1_IRQn, 0);
    NVIC_EnableIRQ(USART1_IRQn);
#endif
#if defined(DMX_USE_USART2) || defined(DMX_USE_USART2_RX)
    UartDmxConfig(USART2);
    NVIC_SetPriority(USART2_IRQn, 0);
    NVIC_EnableIRQ(USART2_IRQn);
#endif
#if defined(DMX_USE_UART3) || defined(DMX_USE_UART3_RX)
    UartDmxConfig(UART3);
    NVIC_SetPriority(UART3_IRQn, 0);
    NVIC_EnableIRQ(UART3_IRQn);
#endif
#if defined(DMX_USE_UART4) || defined(DMX_USE_UART4_RX)
    UartDmxConfig(UART4);
    NVIC_SetPriority(UART4_IRQn, 0);
    NVIC_EnableIRQ(UART4_IRQn);
#endif
#if defined(DMX_USE_USART5) || defined(DMX_USE_USART5_RX)
    UartDmxConfig(USART5);
    NVIC_SetPriority(USART5_IRQn, 0);
    NVIC_EnableIRQ(USART5_IRQn);
#endif
#if defined(DMX_USE_UART6) || defined(DMX_USE_UART6_RX)
    UartDmxConfig(UART6);
    NVIC_SetPriority(UART6_IRQn, 0);
    NVIC_EnableIRQ(UART6_IRQn);
#endif
#if defined(DMX_USE_UART7) || defined(DMX_USE_UART7_RX)
    UartDmxConfig(UART7);
    NVIC_SetPriority(UART7_IRQn, 0);
    NVIC_EnableIRQ(UART7_IRQn);
#endif

    DMX_DEBUG_EXIT();
}

#pragma GCC pop_options